Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.MessageFolder Property
Note: This API is now obsolete.
 Gets path to Tekla Structures messages directory.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Please Use MessagesFolder, Returns multiple places where localization files can be found")]
public static string MessageFolder { get; }
<ObsoleteAttribute("Please Use MessagesFolder, Returns multiple places where localization files can be found")>
Public Shared ReadOnly Property MessageFolder As String
	Get
Property Value
Type: String
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace